app/Http/Controllers/HomeController.php

    public function contactStore(Request $request) {
        $data = $request->all();
        $new_lead = new Lead();
        $new_lead->fill($data);
        $new_lead->save();
---
insert into `leads` (`name`, `email`, `message`, `updated_at`, `created_at`) values ('xxx', 'ddd@skfjvn.it', 'ffff', '2020-07-16 17:33:09', '2020-07-16 17:33:09')