app/Http/Controllers/PostController.php

select * from `posts`
---
    public function index() {
        $posts = Post::all();

select * from `posts` where `slug` = 'come-modificare-lo-sfondo' limit 1
---
    public function show($slug) {
        $post = Post::where("slug", $slug)->first();

select * from `categories` where `slug` = 'smartphone' limit 1
---
    public function category($slug) {
        $category = Category::where("slug",$slug)->first();

select * from `tags` where `slug` = 'influencer' limit 1
---
    public function tag($slug) {
        $tags = Tag::where("slug",$slug)->first();