app/Http/Controllers/Admin/PostController.php

insert into `post_tag` (`post_id`, `tag_id`) values (9, 3)
---
        $new_post->save();
        //inserisco i tag nella tabella relazionale
        if (!empty($data["tags"])) {
            $new_post->tags()->sync($data["tags"]);

select * from `categories`
select * from `post_tag` where `post_id` = 1
select * from `tags`
---
    public function edit(Post $post)
    {
        $categories = Category::all();
        $tags = Tag::all();

select * from `posts` where `slug` = 'aumentare-i-follower-nei-social' limit 1
---
    public function update(Request $request, Post $post)
    {
        $request->validate([
            "title"=> "required|string|max:255|unique:posts,title," .$post->id,
            "content" => "required"
        ]);
        $data = $request->all();
        //genero uno slug
        $slug = Str::of($data['title'])->slug('-');
        //lo salvo in una variabile ad-hoc
        $original_slug= $slug;
        //richiamo i post con lo slug appena generagto
        $post_in_data = Post::where("slug", $slug)->first();

update `posts` set `slug` = 'aumentare-i-follower-nei-social', `posts`.`updated_at` = '2020-07-23 17:33:56' where `id` = 1
delete from `posts` where `id` = 4
---
            $data["cover_image"] = $img_path;
        }

        $post->update($data);
        if (!empty($data["tags"])) {
            $post->tags()->sync($data["tags"]);