app/Http/Controllers/Admin/PostController.php

select * from `categories` where `categories`.`id` in (2, 3)
select * from `posts`
select `tags`.*, `post_tag`.`post_id` as `pivot_post_id`, `post_tag`.`tag_id` as `pivot_tag_id` from `tags` inner join `post_tag` on `tags`.`id` = `post_tag`.`tag_id` where `post_tag`.`post_id` in (1, 2)
---
    public function index()
    {
        $posts = Post::with("category","tags")->get();

select * from `categories`
select * from `tags`
---
    public function create()
    {
        $categories = Category::all();
        $tags = Tag::all();

select * from `posts` where `slug` = 'attrarre-piu-follower-sui-social' limit 1
select * from `posts` where `slug` = 'ggg' limit 1
insert into `posts` (`title`, `content`, `category_id`, `slug`, `updated_at`, `created_at`) values ('Attrarre più follower sui social', 'lorem ipsum...', '3', 'attrarre-piu-follower-sui-social', '2020-07-15 17:43:49', '2020-07-15 17:43:49')
insert into `posts` (`title`, `content`, `category_id`, `slug`, `cover_image`, `updated_at`, `created_at`) values ('ggg', 'gggg', '3', 'ggg', 'uploads/tOfL730bCZgC6oFYBoKOb1EAuEW3QPfLiiuEaaex.png', '2020-07-16 16:08:24', '2020-07-16 16:08:24')
insert into `post_tag` (`post_id`, `tag_id`) values (22, 3)
---
    public function store(Request $request)
    {
        $request->validate([
            "title"=> "required|string|max:255|unique:posts,title",
            "content" => "required"
        ]);
        $data = $request->all();
        $slug = Str::of($data['title'])->slug('-');
        $original_slug= $slug;
        $post = Post::where("slug", $slug)->first();
        $contatore = 0;
        while ($post) {
            $contatore++;
            $slug = $original_slug . '-' . $contatore;
            $post = Post::where('slug', $slug)->first();
        }
        $data['slug'] = $slug;
        $new_post = new Post();
        $new_post->fill($data);
        $new_post->save();
        if (!empty($data["tags"])) {
            $new_post->tags()->sync($data["tags"]);

select * from `categories`
select * from `post_tag` where `post_id` = 9
select * from `tags`
---
    public function edit(Post $post)
    {
        $categories = Category::all();
        $tags = Tag::all();

update `posts` set `content` = 'lorem ipsum....', `slug` = 'come-modificare-lo-sfondo', `posts`.`updated_at` = '2020-07-16 09:26:11' where `id` = 1
delete from `post_tag` where `post_id` = 1 and `tag_id` in (3)
insert into `post_tag` (`post_id`, `tag_id`) values (1, 4)
delete from `post_tag` where `post_id` = 14
---
    public function update(Request $request, Post $post)
    {
        $request->validate([
            "title"=> "required|string|max:255|unique:posts,title," .$post->id,
            "content" => "required"
        ]);
        $data = $request->all();
        $slug = Str::of($data['title'])->slug('-');
        $data['slug'] = $slug;
        $post->update($data);
        if (!empty($data["tags"])) {
            $post->tags()->sync($data["tags"]);
        } else {
            $post->tags()->detach();

delete from `post_tag` where `post_id` = 3
delete from `posts` where `id` = 2
delete from `posts` where `id` = 3
---
    public function destroy(Post $post)
    {
        $post->tags()->detach();
        $post->delete();